/**************************************************
               * JS Beginner Track *
***************************************************/

/***************************************************
* 날짜 : 2018.03.19
* 목표 : 자바스크립트 학습 시작. Node.js 개발환경 구축.
             ******* 코멘트 *******
대망의 자바스크립트 학습 시작.
조금 더 정확하게 말하자면 Node.js 학습이라고 볼 수 있겠다.
node.js를 설치해서 CMD에서 실행시켜본 후 느낀점은,
노드에서 파이썬의 냄새가 난다...

어쨌든 간단한 예제 코드를 실행시켜봤다. 코드는 Node.js/Hello/app.js
localhost:3000 에다가 서버를 올린거다.

IDE에 관해서는, 그냥 서브라임 텍스트 같은 가벼운 에디터를 쓰는 경우도 있고,
따로 WebStorm이라는 IDE를 설치하는 경우도 있는데, 그냥 비주얼 스튜디오로 할란다.

그래서 비주얼 스튜디오에 node.js 프로젝트를 한번 만들어봤다. 대충 어떤 식으로 파일이 구성되는지 봐야지.
package라는 json이랑... readme가 자동으로 생성되는건 신박하다.
그 외에 소스코드엔 자동으로 Hello World를 띄워놨네.
일단은 이 프로젝트에서 콘솔 입출력을 통해 간단한 문법을 배워보자.
왠만하면 이번주에 끝낼 수 있도록.

그리고 여담으로, 복지관에서 TODOs.txt라는 텍스트 파일을 만들어서 오늘 집에가서 할 일들을 미리 적어놨는데,
집에서 부팅하면 이 파일을 자동으로 읽어서 화면에 띄워주는 프로그램을 만들어보는건 어떨까 하는 생각이 들었다.
대충 시작 프로그램으로 등록하는 방법이 있을거고, 트레이창으로 만드는 법도 있을테니. C#으로.
***************************************************/

/***************************************************
* 날짜 : 2018.03.21
* 목표 : 자바스크립트 기초 문법. 프로젝트 구상.
             ******* 코멘트 *******
어제는 배탈나서 앓아누운 덕에 쉬었다.

참고자료 https://www.codecademy.com/tracks/javascript
이긴 한데...
아무래도 내가 좀 옛날 자료를 참고했나보다.
https://www.codecademy.com/learn/introduction-to-javascript
이걸 더 권장하고 있는 것 같은데, 이미 해놓은게 있어서 넘어가기가 좀 그렇다.

그래도 때로는 과감함도 있어야 하는 법. 한번 넘어가 보자.

일단 코드카데미라는 사이트는 보이는바와 같이 온라인으로 코딩하면서 공부할 수 있는 사이트다.
그러니까 내가 C#을 공부했던 방법처럼 내 git 저장소의 파일에다가 직접 코딩하면서 코멘트를 다는게 아니라,
저 사이트에서 코딩하면서 공부하는거.
그러니까 직설적으로 이야기하자면, 커밋이 많이 없을 수도 있다.
뭐 이런 프로젝트의 커밋 횟수야 다 자기만족이니까 그냥 그러려니.

확실히 새로 바꾼 코스가 더 좋은것같다. 더 최신 버전인듯.

흠... 일단, 브랜치 정리를 좀 해야할거같은데,
TODOs.txt 는 master 브랜치에 놔두고,
일단 지금 수정된 파일들 마스터에 커밋넣고,
node.js 브랜치를 새로 만들고,
junk에다가 새 C# 프로젝트를 올려버릴까 아니면 새 브랜치를 만들까?
아무래도 새 브랜치로 만들어서 좀 각을 잡는게 좋을듯.

어... 일단 자바스크립트 기초문법 분량이 좀 많긴 하다.
아무래도 꾸준히 복지관에서 따로 하면서, 집에서는 node.js 학습 다음주 부터 바로 시작해야할듯.
***************************************************/