/**************************************************
               * JS Beginner Track *
***************************************************/

/***************************************************
* 날짜 : 2018.03.19
* 목표 : 자바스크립트 학습 시작. Node.js 개발환경 구축.
             ******* 코멘트 *******
대망의 자바스크립트 학습 시작.
조금 더 정확하게 말하자면 Node.js 학습이라고 볼 수 있겠다.
node.js를 설치해서 CMD에서 실행시켜본 후 느낀점은,
노드에서 파이썬의 냄새가 난다...

어쨌든 간단한 예제 코드를 실행시켜봤다. 코드는 Node.js/Hello/app.js
localhost:3000 에다가 서버를 올린거다.

IDE에 관해서는, 그냥 서브라임 텍스트 같은 가벼운 에디터를 쓰는 경우도 있고,
따로 WebStorm이라는 IDE를 설치하는 경우도 있는데, 그냥 비주얼 스튜디오로 할란다.

그래서 비주얼 스튜디오에 node.js 프로젝트를 한번 만들어봤다. 대충 어떤 식으로 파일이 구성되는지 봐야지.
package라는 json이랑... readme가 자동으로 생성되는건 신박하다.
그 외에 소스코드엔 자동으로 Hello World를 띄워놨네.
일단은 이 프로젝트에서 콘솔 입출력을 통해 간단한 문법을 배워보자.
왠만하면 이번주에 끝낼 수 있도록.

그리고 여담으로, 복지관에서 TODOs.txt라는 텍스트 파일을 만들어서 오늘 집에가서 할 일들을 미리 적어놨는데,
집에서 부팅하면 이 파일을 자동으로 읽어서 화면에 띄워주는 프로그램을 만들어보는건 어떨까 하는 생각이 들었다.
대충 시작 프로그램으로 등록하는 방법이 있을거고, 트레이창으로 만드는 법도 있을테니. C#으로.
***************************************************/