/*****************************
* 2018.01.10 Xamarin
* 목표 : 자마린 슬쩍 엿보기
     ******* 코멘트 *******
띠용이란 말을 하지 않을 수 없다.
C#으로 안드로이드 어플리케이션을 만들 수 있습니다!
사실 그것보다 더 중요한건 크로스 플랫폼이 가능하다는것!
Xamarin.Forms 를 통해 IOS, Android, Windows 신경 안쓰고 어플리케이션을 만들 수 있다.
근데 프로젝트는 Xamarin.Android로 만들었다. 사실 약간 솔깃해서 충동적으로 만들어본 거라 뭐,
일단 자마린의 첫번째 의의 C#으로 만드는 안드로이드 어플리케이션을 체험해보고싶다.

새삼스럽지만, 비주얼 스튜디오가 참 강력한 툴이라는 생각이 든다.
안드로이드 스튜디오에 비해선 xml 렌더링 하는 속도가 느린 것 같긴 하지만...

아이고 아는게 없으니 버튼에 이벤트 하나 등록하는것도 힘드네.

가상머신이 몹시 묵직한가보다. 켜지는데 엄청 느림.
하도 안켜져서 설거지를 다 하고왔다.

오늘은 뭐 이렇게 살짝 엿보고 끝.
******************************/