/*****************************
* 2017.09.07 서보모터 제어 학습
* 목표 : 와이파이 연결, 통신.
     ******* 코멘트 *******
참고자료 http://deneb21.tistory.com/272 (명령어 직접 입력으로 와이파이 연결)
AT+CWMODE=1           (STATION모드로 설정)
AT+CWLAP              (와이파이 찾기)
AT+CWJAP="SSID","PW"  (AP에 접속)
오후 2시경 CWJAP에서 막힘. 메세지없이 FAIL을 반환함.
안된다아아아아아아아아아아앙아아아아아아아앙
오시 5시27분
해결했다아아아아아아아아아아아아아아ㅏㅏㅏ아ㅏㅏㅇ아ㅏ아앙아ㅏ아아아아ㅏ
펌웨어 업데이트 하지말고 115200보드레이트에서 그냥 사용함.
일단은 작동이 몹시 이상하게 되니까 새 모듈이 올때까지 대기해야할듯.
******************************/


void setup(){
}
void loop(){
}

