/**************************************************
         * DeZipper. Command Line Version *
***************************************************/

/***************************************************
* 날짜 : 2017.11.02
* 목표 : 프로젝트 생성
             ******* 코멘트 *******
부산 다녀오느라 휴가였음. 실은 어제 수요일에 시작했어야하나 너무 피곤했던 관계로 오늘 시작.
할일은 https://github.com/anteater333/Anteater_lab/projects/1 여기에 정리돼있음. github 짱짱.

일단은 CMD 창에서 실행할 수 있는 프로그램을 만드는 거 부터 하자. 그 편이 쉬우니까.
프로그램 다 작성 후에 WinForms. GUI에 연결하자.

그리고 이제 이런 프로젝트는 Anteater_Projects 폴더에서 작업.
완성 후엔 이런 주석같은 군더더기 제거해서 Anteater_Releases 폴더에 복사.

앞으로 해야할 일
시나리오 작성.
ZipFile 클래스 공부.
***************************************************/