/**************************************************
                * TODO Reader *
***************************************************/

/***************************************************
* 날짜 : 2018.03.29
* 목표 : 기능구현, OptionForm 컨트롤 배치.
             ******* 코멘트 *******
생각보다 MetroFramework가 쓰기 까다롭다.
그래도 기본 윈폼 컨트롤들 보단 보기에 깔끔하긴 함. 대충 배치했는데도 그럴듯하게 보인다.
확인 취소 버튼만 좀 더 이쁘게 만들고싶은데, 어떻게 해야할지 모르겠음. 일단 보류.

그리고 Http GET request를 구현하자.

GET 상당히 간단하게 구현했고, 텍스트 잘라내기도 했다.
그래서 오늘 할일만 딱 불러왔는데, 문제는 다음줄로 안넘어간다!
Split 메소드로 해결했다! 이번 프로젝트는 Split 메소드를 상당히 요긴하게 쓰는듯.

오늘은 여기까지 내일은 옵션 쪽을 완성하자.
추가로 멋들어진 애니메이션도 넣어보자. 주로 투명도를 가지고 노는 방식으로 만들 수 있을듯.
***************************************************/